# 2. DataFrame
2차원 데이터(Series 들의 모음)

# Data 준비
사전(dict) 자료구조를 통해 생성
예) 슬램덩크 주요 인물 8명에 대한 데이터

In [2]:
data = {
    '이름' : ['강민수', '배성현', '박세환', '정태경'],
    '학교' : ['세종초', '포항초', '동탄초', '덕소초'],
    '국어' : ['100', '95', '90', '85'],
    '영어' : ['85', '90', '95', '100'],
    '수학' : ['100', '95', '90', '85'],
    '과학' : ['85', '90', '95', '100'],
    '사회' : ['100', '95', '90', '85'],
    'SW특기' : ['Python', 'C', 'C++', '']
}
data

{'이름': ['강민수', '배성현', '박세환', '정태경'],
 '학교': ['세종초', '포항초', '동탄초', '덕소초'],
 '국어': ['100', '95', '90', '85'],
 '영어': ['85', '90', '95', '100'],
 '수학': ['100', '95', '90', '85'],
 '과학': ['85', '90', '95', '100'],
 '사회': ['100', '95', '90', '85'],
 'SW특기': ['Python', 'C', 'C++', '']}

In [6]:
data['이름']

['강민수', '배성현', '박세환', '정태경']

In [7]:
data['수학']

['100', '95', '90', '85']

## DataFrame 객체 생성

In [8]:
import pandas as pd
df = pd.DataFrame(data)

In [9]:
df

    이름   학교   국어   영어   수학   과학   사회    SW특기
0  강민수  세종초  100   85  100   85  100  Python
1  배성현  포항초   95   90   95   90   95       C
2  박세환  동탄초   90   95   90   95   90     C++
3  정태경  덕소초   85  100   85  100   85

## 데이터접근

In [10]:
df['이름']

0    강민수
1    배성현
2    박세환
3    정태경
Name: 이름, dtype: object

In [11]:
df['학교']

0    세종초
1    포항초
2    동탄초
3    덕소초
Name: 학교, dtype: object

In [12]:
df[['이름', '학교']]

    이름   학교
0  강민수  세종초
1  배성현  포항초
2  박세환  동탄초
3  정태경  덕소초

## DataFrame 객체 생성(Index 지정)

In [14]:
df = pd.DataFrame(data, index=['1번', '2번','3번','4번'])
df

     이름   학교   국어   영어   수학   과학   사회    SW특기
1번  강민수  세종초  100   85  100   85  100  Python
2번  배성현  포항초   95   90   95   90   95       C
3번  박세환  동탄초   90   95   90   95   90     C++
4번  정태경  덕소초   85  100   85  100   85

## DataFrame 객체 생성(Column 지정)
data 중에서 원하는 column만 선택하거나, 순서 변경 가능

In [15]:
df = pd.DataFrame(data, columns=['이름', '학교', 'SW특기'])
df

    이름   학교    SW특기
0  강민수  세종초  Python
1  배성현  포항초       C
2  박세환  동탄초     C++
3  정태경  덕소초